In [8]:
import pandas as pd
from collections import OrderedDict

In [9]:
friend_list = [
    ['name', ['John', 'Jenny', 'Nate']],
    ['age', [20,30,30]],
    ['job', ['student', 'developer','teacher']]
]
df = pd.DataFrame.from_dict(OrderedDict(friend_list))  #데이터프레임 생성

In [10]:
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher

In [11]:
#jenny와 nate 정보만 가져오기
df[1:3]

    name  age        job
1  Jenny   30  developer
2   Nate   30    teacher

In [12]:
df   #데이터가 삭제되는 건 아님

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher

In [13]:
df = df[1:3]   #데이터 프레임에 [1:3]만 저장한다

In [14]:
df

    name  age        job
1  Jenny   30  developer
2   Nate   30    teacher

In [15]:
friend_list = [
    ['name', ['John', 'Jenny', 'Nate']],
    ['age', [20,30,30]],
    ['job', ['student', 'developer','teacher']]
]
df = pd.DataFrame.from_dict(OrderedDict(friend_list))  #데이터프레임 생성

In [16]:
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher

In [17]:
df.loc[[0,2]]   #원하는 값만 나타냄

   name  age      job
0  John   20  student
2  Nate   30  teacher

In [18]:
df = df.loc[[0,2]]

In [19]:
df

   name  age      job
0  John   20  student
2  Nate   30  teacher

In [20]:
friend_list = [
    ['name', ['John', 'Jenny', 'Nate']],
    ['age', [20,30,30]],
    ['job', ['student', 'developer','teacher']]
]
df = pd.DataFrame.from_dict(OrderedDict(friend_list))  #데이터프레임 생성

In [21]:
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher

## by column condition

In [23]:
df[df.age>25]   #조건에 따른 결과값 출력

    name  age        job
1  Jenny   30  developer
2   Nate   30    teacher

In [24]:
df.query('age>25')

    name  age        job
1  Jenny   30  developer
2   Nate   30    teacher

In [25]:
df[(df.age>25)&(df.name == 'Nate')]

   name  age      job
2  Nate   30  teacher

## Filter Column
### by index

In [27]:
friend_list = [
    ['John', 20, 'studnet'],
    ['Jenny', 30, 'developer'],
    ['Nate', 30, 'teacher']
]
df = pd.DataFrame.from_records(friend_list)
df

       0   1          2
0   John  20    studnet
1  Jenny  30  developer
2   Nate  30    teacher

In [28]:
df.iloc[:,0:2]   #[row,column] -- row는 전체, column은 0~1까지 표시

       0   1
0   John  20
1  Jenny  30
2   Nate  30

In [29]:
df.iloc[0:2,0:2]

       0   1
0   John  20
1  Jenny  30

## by column name

In [32]:
df = pd.read_csv('desktop/data/friend_list_no_head.csv', header = None, names = ['name', 'age', 'job'] ) #데이터 프레임 생성

In [33]:
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [34]:
df_filtered = df[['name', 'age']]   #column name으로 filter하기

In [35]:
df_filtered

    name  age
0   John   20
1  Jenny   30
2   Nate   30
3  Julia   40
4  Brian   45
5  Chris   25

In [37]:
df.filter(items=['age','job'])    #column name으로 filter하기2

   age        job
0   20    student
1   30  developer
2   30    teacher
3   40    dentist
4   45    manager
5   25     intern

In [38]:
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [39]:
df.filter(like='a',axis=1)    #column name에 'a'가 들어간 것들만 보이기

    name  age
0   John   20
1  Jenny   30
2   Nate   30
3  Julia   40
4  Brian   45
5  Chris   25

In [40]:
df.filter(regex='b$', axis=1)   #column name이 'b'로 끝나는 것만 보이기

         job
0    student
1  developer
2    teacher
3    dentist
4    manager
5     intern

In [41]:
df.filter(regex='e$', axis=1)   #column name이 'e'로 끝나는 것만 보이기

    name  age
0   John   20
1  Jenny   30
2   Nate   30
3  Julia   40
4  Brian   45
5  Chris   25

In [42]:
df.filter(regex='o$', axis=1)   #맞는 데이터 존재하지 않을 때

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3, 4, 5]